&Опция(Имя = "a", Описание = "Цвет")
&ТПеречисление
&Перечисление(
	Имя = "green",
	Значение = "Зеленый",
	Описание = "Консоль будет зеленого цвета"
)
&Перечисление(
	Имя = "red",
	Значение = "Красный",
	Описание = "Консоль будет красного цвета"
)
Перем Цвет;

&Опция(Имя = "b", Описание = "Статус")
&ТПеречисление
&Перечисление(
	Имя = "success",
	Значение = 0,
	Описание = "Успех"
)
&Перечисление(
	Имя = "warning",
	Значение = 1,
	Описание = "Предупреждение"
)
&Перечисление(
	Имя = "error",
	Значение = 2,
	Описание = "Ошибка"
)
Перем Статус;

&Аргумент(Имя = "ARG", Описание = "Аргумент")
&ТПеречисление
&Перечисление(Имя = "sysdir", Значение = "path/to/system/dir", Описание = "Системный каталог")
&Перечисление(Имя = "usrdir", Значение = "path/to/user/dir", Описание = "Пользовательский каталог")
Перем Каталог;

Перем Результат Экспорт;

&КомандаПриложения(Имя = "testingenum")
Процедура ПриСозданииОбъекта()
	Результат = Новый Массив();
КонецПроцедуры

&ВыполнениеКоманды
Процедура СформироватьРезультат() Экспорт

	Результат.Добавить(Цвет);
	Результат.Добавить(Статус);
	Результат.Добавить(Каталог);
	
КонецПроцедуры
