
&НаборОпций("НаборОпцийПодключения")
Перем ОпцииПодключения;

&НаборОпций("НаборОпцийВыгрузки")
Перем ОпцииВыгрузки;

Перем Результат Экспорт;

&КомандаПриложения(Имя = "dualsets", Описание = "Команда с двумя наборами опций")
Процедура ПриСозданииОбъекта()
КонецПроцедуры

&ВыполнениеКоманды
Процедура СформироватьРезультат() Экспорт

	Результат = Новый Массив();
	Результат.Добавить(ОпцииПодключения.СтрокаПодключения);
	Результат.Добавить(ОпцииПодключения.ВерсияПлатформы);
	Результат.Добавить(ОпцииВыгрузки.КаталогВыгрузки);

КонецПроцедуры
