&Аргумент(
	Имя = "ARG",
	Описание =
		"Я
		| аргумент с многострочным
		| описанием"
)
&ТСтрока
Перем Аргумент;

&Опция(
	Имя = "option o",
	Описание =
		"Я
		| опция с многострочным
		| описанием"
)
&Флаг
Перем Опция;

Перем Результат Экспорт;

&КомандаПриложения(
	Имя = "мultiline",
	Описание =
		"Я
		| команда с многострочным
		| описанием"
)
Процедура ПриСозданииОбъекта()
	Результат = Новый Массив();
КонецПроцедуры

&ВыполнениеКоманды
Процедура СформироватьРезультат() Экспорт

	Результат.Добавить(Аргумент);
	Результат.Добавить(Опция);

КонецПроцедуры
