
&НаборОпций("НаборОпцийРасширенный")
Перем РасширенныеОпции;

&Аргумент(Имя = "FILE", Описание = "Путь к файлу")
&ТСтрока
Перем ПутьКФайлу;

Перем Результат Экспорт;

&КомандаПриложения(Имя = "recursive", Описание = "Команда с рекурсивным набором опций")
Процедура ПриСозданииОбъекта()
КонецПроцедуры

&ВыполнениеКоманды
Процедура СформироватьРезультат() Экспорт

	Результат = Новый Массив();
	Результат.Добавить(ПутьКФайлу);
	Результат.Добавить(РасширенныеОпции.КаталогВыгрузки);
	Результат.Добавить(РасширенныеОпции.ОпцииПодключения.СтрокаПодключения);
	Результат.Добавить(РасширенныеОпции.ОпцииПодключения.ВерсияПлатформы);

КонецПроцедуры
