
&НаборОпций("НаборОпцийПодключения")
Перем БазовыеОпции;

&Аргумент(Имя = "PATH", Описание = "Путь до *.cf")
&ТСтрока
Перем ПутьДоКонфигурации;

Перем Результат Экспорт;

&КомандаПриложения(Имя = "importing", Описание = "Загрузка конфигурации")
Процедура ПриСозданииОбъекта()
КонецПроцедуры

&ВыполнениеКоманды
Процедура СформироватьРезультат() Экспорт

	Результат = Новый Массив();
	Результат.Добавить(ПутьДоКонфигурации);
	Результат.Добавить(БазовыеОпции.СтрокаПодключения);
	Результат.Добавить(БазовыеОпции.ВерсияПлатформы);

КонецПроцедуры
