
&Опция(Имя = "n name", ЗначениеПоУмолчанию = "noname", Описание = "Имя пользователя")
Перем ИмяПользователя;

Перем ТекстПриветствия Экспорт;

&КомандаПриложения(Имя = "hello")
Процедура ПриСозданииОбъекта()
		
КонецПроцедуры

Функция Тест() Экспорт
	Возврат 1; 
КонецФункции

Процедура СформироватьТекстПриветствия()

	ТекстПриветствия = "Привет " + ИмяПользователя;
	
КонецПроцедуры

Функция ИмяПользователя() Экспорт
	Возврат ИмяПользователя;
КонецФункции

Процедура ОписаниеКоманды(КомандаПриложения) Экспорт
	
	КомандаПриложения.Опция("n name", "", "Имя пользователя");

КонецПроцедуры

Процедура ВыполнитьКоманду(Знач КомандаПриложения) Экспорт
	
	ИмяПользователя = КомандаПриложения.ЗначениеОпции("name");

	СформироватьТекстПриветствия();

КонецПроцедуры
	

