#Использовать autumn
#Использовать asserts
#Использовать ".."
#Использовать "."
#Использовать "./Моки"

Функция ПолучитьПоделку()
	Поделка = Новый Поделка();
	Поделка.ПросканироватьКаталог("tests/Классы");
	Возврат Поделка;
КонецФункции

&Тест
Процедура ПолучениеКомандыПоИмени() Экспорт

	// Дано

	Поделка = ПолучитьПоделку();
	Поделка.ДобавитьРогатку(Тип("МокРогатки"));
	Поделка.ЗапуститьПриложение();

	// Когда
	Команда = Поделка.НайтиЖелудь("hello");

	// Тогда
	Ожидаем.Что(Команда.Тест(), "Вызов метода команды").Равно(1);
	
КонецПроцедуры

&Тест
Процедура ПолучениеМассиваКоманд() Экспорт

	// Дано

	Поделка = ПолучитьПоделку();
	Поделка.ДобавитьРогатку(Тип("МокРогатки"));
	Поделка.ЗапуститьПриложение();

	

	// Когда
	Команды = Поделка.НайтиЖелуди("КомандаПриложения");

	// Тогда
	Ожидаем.Что(Команды, "Массив команда").ИмеетТип("ФиксированныйМассив");
	Ожидаем.Что(Команды.Количество(), "Массив команд не пустой").Больше(0);
	
КонецПроцедуры

&Тест
Процедура ВызовКомандыПривет() Экспорт
	// Дано

	Поделка = ПолучитьПоделку();
	Поделка.ДобавитьРогатку(Тип("МокРогатки"));
	Поделка.ЗапуститьПриложение();

	// Когда

	Команда = Поделка.НайтиЖелудь("hello");
	КонсольноеПриложение = Поделка.НайтиЖелудь("КонсольноеПриложение");

	ПараметрыКоманды = Новый Массив();
	ПараметрыКоманды.Добавить("hello");
	ПараметрыКоманды.Добавить("-n");
	ПараметрыКоманды.Добавить("Никита");

	КонсольноеПриложение.Запустить(ПараметрыКоманды);

	// Тогда

	Ожидаем.Что(Команда.ИмяПользователя(), "Параметр передан в команду").Равно("Никита");
	Ожидаем.Что(Команда.ТекстПриветствия, "Параметр передан в команду, и она выполнена").Равно("Привет Никита");

КонецПроцедуры

&Тест
Процедура ВызовКомандыПриветСДекоратором() Экспорт
	// Дано

	Поделка = ПолучитьПоделку();
	Поделка.ДобавитьРогатку(Тип("МокРогатки"));
	Поделка.ЗапуститьПриложение();

	// Когда

	Команда = Поделка.НайтиЖелудь("bye");
	КонсольноеПриложение = Поделка.НайтиЖелудь("КонсольноеПриложение");

	ПараметрыКоманды = Новый Массив();
	ПараметрыКоманды.Добавить("bye");
	ПараметрыКоманды.Добавить("--name");
	ПараметрыКоманды.Добавить("Никита");

	КонсольноеПриложение.Запустить(ПараметрыКоманды);

	// Тогда

	Ожидаем.Что(Команда.ИмяПользователя(), "Параметр передан в команду").Равно("Никита");
	Ожидаем.Что(Команда.ТекстПрощания, "Параметр передан в команду, и она выполнена").Равно("Пока Никита");

КонецПроцедуры

